{
        "welcome": "Hello! My name is",
        "cv": "Download CV",
        "about": "About Me",
        "cvDownload": "https://drive.google.com/file/d/1stTu5Ko6wgNovBMsSKcI7UzHv3xzhFZR/view?usp=drive_link",
        "cursos": "Courses",
        "contacto": "Contact",
        "resume": "Resume",
        "whoT": "Who am I?",
        "andMore": "QA Automation | Front-End Developer | Tech Enthusiast and more...",
        "me1": "👋 Hi! Nice to meet you, I'm Agus. I was born in Tandil, but I'm currently living in Balcarce, Argentina.\n\n🎨 I graduated as a Graphic Design Technician and, over time, I discovered a strong curiosity for the world of development and technology.\n\n💻 I'm currently studying Front-End Development, while also complementing my studies in areas such as software development and testing. I'm a very curious when it comes to technology. I love exploring the different disciplines within the IT world.\n\n🧪 I found my passion in testing and automation. Today, I work professionally in the field of Automated Testing.\n🚀 I'm a proactive person with a strong desire to develop my skills and learn new ones along the way. As an organized and highly motivated, I'm able to adapt to any circumstance and always give my best in any project.\n\nI invite you to get to know me!",
        "meTitle": "More About Me",
        "age": "years old",
        "years":"Age",
        "Telefono": "Phone: + 54 2494 381315",
        "Dirección": "Address: Balcarce, Buenos Aires, Argentina. ",
        "food": "Favorite food: Hot Dogs",
        "hobbie": "Hobby: I enjoy taking analog photos",
        "sport": "Favorite Sport: Boxing",
        "tools": "Tools",
        "tool1": "UI Automation",
        "tool2": "API Testing",
        "tool3": "Project Management",
        "tool4": "Test Case Management",
        "tool5": "Continuous Integration (CI/CD)",
        "tool6": "Design Programs",
        "tools7": "Digital Marketing",
        "my": "My Resume",
        "laboral": "Work Experience",
        "mesWork": "November 2021 - November 2023",
        "br1": "• UI automated testing with Katalon and SikuliX.\n• API testing (SOAP and REST) using Katalon.\n• Test framework configuration, test case creation, and defect reporting.\n\n• CI/CD integration with Jenkins and use of tools like Jira, GitLab, SoapUI, and Postman for improving test efficiency.\n\n• Project structure design, including naming conventions and best practices, along with Katalon support implementation to ensure automation best practices.\n\n• Code review, debugging, and optimization to ensure quality and efficiency in the automation process.",
        "br2": "• Functional and usability validation through manual and exploratory testing, ensuring software quality.\n• UI and API (REST and SOAP) test automation with Katalon and Postman, integrating test cases into CI/CD pipelines with Jenkins.\n• Design and execution of load, stress, and performance testing with JMeter, evaluating system scalability and optimizing performance.\n• Bug reporting and analysis, with detailed documentation and log analysis to identify and resolve issues, ensuring defect traceability.\n• Test management following agile methodologies (Scrum, OKR), participating in refinement meetings with the development team.",
        "education": "Education",
        "front": "Diploma in Front-End Development",
        "untref": "National University of Tres de Febrero",
        "descruntref": "Semi-presential diploma that covers web development with HTML, CSS, and JavaScript, incorporating modern technologies such as React and Node.js, along with UX/UI design to create attractive and functional interfaces.",
        "descrtudai": "Technical program focused on software development, programming, and system verification, preparing professionals to work on web and mobile applications, as well as information systems.",
        "descripat": "Program focused on creating effective graphic pieces, including brochures and posters, with an emphasis on color theory, typography, and visual composition, and the use of advanced digital tools.",
        "grap": "Graphic Design Technician",
        "tudai": "University Technical Degree in Computer Application Development",
        "university": "National University of the Central Province of Buenos Aires",
        "myexp": "My Experience in the IT World",
        "aboutxp": "My journey began in graphic design, where I learned the importance of attention to detail, organization, and a creative approach.\nIn recent years, I have specialized in the field of automated testing. I am proficient with tools such as Katalon for automated tests, as well as Postman for REST and SOAP API testing. I have worked with continuous integration using Jenkins and Git, and also performed mobile testing with Appium.\n\nAt the same time, I explored the world of web development using React, creating my own applications and combining them with IoT projects using Arduino.\nI have been expanding my knowledge in Python and frontend development, driven by the motivation to continue growing professionally in the IT world.\n\nIn my current role as a QA Automation Engineer, I had the opportunity to lead initiatives from scratch, defining testing strategies, establishing clear naming conventions, working under the Page Object Model (POM) pattern, and developing reusable functions to optimize and streamline testing processes.\n\nMy approach combines the precision and attention to detail gained from graphic design with the logic and structure required for software development and testing. I am passionate about the challenge of constant evolution and exploring new tools.",
        "miscursos": "My Courses",
        "Idiomas": "Languages",
        "espanol": "Spanish - Native",
        "ingles": "English - B2",
        "services": "My Services",
        "service1.title": "Automated Testing",
        "service1.description":"I have experience in automated testing for UI, back-end, and performance, using tools such as Selenium, Cypress, Katalon, Postman, Newman, and JMeter. I have also worked with Jenkins and Git for continuous integration, staying up to date with new technologies and methodologies.\n\nI specialize in organizing and reusing code to optimize testing processes, ensuring scalable and maintainable scripts. Currently, I am training in Appium, UFT, and RPA to continue expanding my automation skills.",
        "service2.title": "Manual Testing",
        "service2.description": "Passionate about software quality, I have experience in manual, exploratory, unit, and regression testing. I design test cases, report bugs, and perform validations using SQL queries and log monitoring, working under agile methodologies.\n\nI participate in freelance crowdsourced testing platforms for mobile apps, web, and Chromecast devices, performing payment, localization, and usability tests. I use tools like TestLink, JIRA, Zephyr, and Xray to ensure proper traceability in test cases.",
        "service3.title": "Full Stack Development",
        "service3.description": "I currently specialize in Front-End development, working with modern frameworks and applying UX/UI design concepts to build intuitive, responsive, and attractive interfaces. I design web templates and develop applications using React with TypeScript and React Native.\n\nOn the Back-End side, I integrate technologies such as Node.js, FastAPI, and MongoDB, implementing service authentication and API documentation with Swagger. I also have knowledge of Angular, JavaScript, Groovy, and Python, always striving for clean and scalable code.",
        "service4.title": "Graphic Design",
        "service4.description": "As a graphic design technician, I am skilled in using Adobe tools to create visual communication pieces such as brochures, social media posts, visual identities, and brand catalogs, applying visual laws like color theory, typography, and composition.\n\nI design web interfaces applying usability and visual aesthetics principles, from buttons and banners to full site structures, ensuring coherent, functional, and project-aligned pieces.",
        "service5.title": "Community Management",
        "service5.description": "I studied as a Community Manager, managing social media like Facebook, Instagram, and WhatsApp Business for businesses and brands, adapting content to each client’s tone and optimizing community communication.\n\nI design graphic pieces, plan content calendars, conduct product photo shoots, and manage paid campaigns on Facebook and Instagram Ads, combining creativity and metrics analysis to create active and engaged communities.",
        "service6.title": "Project Management",
        "service6.description": "I have led and managed internal projects applying Project Management practices, using tools like Trello and GitLab for task coordination, responsibility assignment, and progress tracking under agile methodologies like Scrum.\n\nI plan test cycles, diagram software flows, define standard nomenclature, and work with OKR to ensure strategic objectives. I also encourage the adoption of new tools and methodologies to improve organization and team efficiency.",
        "remote": "I am available for freelance and remote work, either full-time or part-time. Excited to collaborate on new projects and add value!",
        "charlemos": "Let's Chat!",
        "portfolio": "My Portfolio",
        "new": "New",
        "social": "Social Media",
        "card1": "Social Media",
        "card1s": "Design of social media posts.",
        "card2s": "Design of party posters, and more...",
        "card3": "Logo design, packaging.",
        "contact1": "Let's talk! Send me your message",
        "contact2": "Send",
        "contact3": "Contact Information:",
        "contact4": "Phone: +54 2494381315",
        "contact5": "Address: Balcarce, Buenos Aires, Argentina.",
        "Lugar": "Place",
        "date": "Date",
        "Ambito": "Ambit",
        "seecertif": "See Certificate",
        "mesWork1": "November 2023 - Present",
        "placeholderbusqueda":"Filter courses by name...",
        "orderby":"Order by...", 
        "fecharecent":"Date (most recent)", 
        "placecourse":"Institute (A-Z)", 
        "thCurso":"Course Name",
        "thInstitute":"Institute",
        "thFecha":"Date",
        "thAmbito":"Expertise",
        "thCertificado":"Certificate",
        "Siguiente":"Next →", 
        "Anterior":"← Previous",
        "gitp":"Github Projects", 
        "pName": "Name *",
        "pMessage": "Enter a message *", 
        "confirm": "Message sent successfully!", 
        "msgerror":"There was an error sending the message. Please try again", 
        "gith":"Go to GitHub"
    }
    