{
    "welcome": "¡Hola! Mi nombre es",
    "cv": "Descargar CV",
    "cvDownload": "https://drive.google.com/file/d/1zAHXyW0bP6ppPHAUzjBVzRAIf3y9CpRM/view?usp=sharing",
    "about": "Sobre Mi",
    "cursos": "Cursos",
    "resume": "Curriculum",
    "contacto": "Contacto",
    "whoT": "¿Quien Soy?",
    "andMore": "QA Analyst | Automation Tester | Tech Enthusiast y más...",
    "me1": "👋 ¡Hola! Un gusto, soy Agus. Nací en Tandil, pero actualmente vivo en Balcarce, Argentina.\n\n🎨 Me gradué como Técnica en Diseño Gráfico y, con el tiempo, descubrí una gran curiosidad por el mundo del desarrollo y la tecnología.\n\n💻 Actualmente estoy realizando una Diplomatura en Desarrollo Front-End, mientras complemento mis estudios de manera autodidacta en áreas como desarrollo y testing de software. Me considero una persona muy curiosa por la tecnología, me gusta explorar las distintas disciplinas del mundo IT.\n\n🧪 Encontre la pasión por el testing y la automatización. Hoy me desempeño profesionalmente en el área de Testing Automatizado\n🚀Soy una persona pro-activa con muchas ganas de desarrollar mis conocimientos y aprender nuevos en el proceso. Como persona organizada y con gran motivación, soy capaz de adaptarme a cualquier circunstancia y dar siempre lo mejor de mí en cualquier proyecto.\n\n¡Te invito a conocerme!",
    "meTitle": "Más sobre mí",
    "age": "años",
    "years":"Edad",
    "Telefono": "Telefono: + 54 2494 381315",
    "Dirección": "Dirección: Balcarce, Buenos Aires, Argentina",
    "food": "Comida favorita: Panchos",
    "hobbie": "Hobby: Me gusta sacar fotos analógicas",
    "sport": "Deporte Favorito: Boxeo",
    "tools": "Herramientas",
    "tool1": "Automatización de UI",
    "tool2": "API Testing",
    "tool3": "Gestor de Proyectos",
    "tool4": "Gestor de Casos de Prueba",
    "tool5": "Integración continua (CI/CD)",
    "tool6": "Programas de Diseño",
    "tools7": "Marketing Digital",
    "my": "Mi curriculum",
    "laboral": "Experiencia Laboral",
    "mesWork": "Noviembre 2021 - Noviembre 2023",
    "quehago": "Testing Manual",
    "br1": "• Pruebas automatizadas de UI con Katalon y SikuliX.\n• Pruebas de API (SOAP y REST) utilizando Katalon.\n• Configuración del marco de pruebas, creación de casos de prueba y reporte de defectos.\n\n• Integración CI/CD con Jenkins y uso de herramientas como Jira, GitLab, SoapUI y Postman para mejorar la eficiencia de las pruebas.\n\n• Diseño de la estructura del proyecto, incluyendo convenciones de nombres y mejores prácticas, junto con la implementación de soporte en Katalon para asegurar las mejores prácticas en la automatización.\n\n• Revisión de código, depuración y optimización para garantizar la calidad y eficiencia en el proceso de automatización.",
    "br2": "• Validación funcional y de usabilidad a través de pruebas manuales y exploratorias, asegurando la calidad del software.\n• Automatización de pruebas de UI y API (REST y SOAP) con Katalon y Postman, integrando casos de prueba en flujos CI/CD con Jenkins.\n• Diseño y ejecución de pruebas de carga, estrés y rendimiento con JMeter, evaluando la escalabilidad del sistema y optimizando su performance.\n• Reporte y análisis de bugs, con documentación detallada y análisis de logs para identificar y solucionar errores, garantizando la trazabilidad de los defectos.\n• Gestión de pruebas siguiendo metodologías ágiles (Scrum, OKR), participando en las ceremonias de refinamiento con el equipo de desarrollo.",
    "education": "Educación",
    "front":"Diplomatura en Programación Frontend",
    "untref":"Universidad Nacional de Tres de Febrero",
    "descruntref":"Diplomatura semi-presencial que cubre el desarrollo web con HTML, CSS y JavaScript, incorporando tecnologías modernas como React y Node.js, además de diseño UX/UI para crear interfaces atractivas y funcionales.",
    "descrtudai":"Carrera técnica enfocada en el desarrollo de software, programación, y verificación de sistemas, preparando a los profesionales para trabajar en aplicaciones web y móviles, así como en sistemas de información.",
    "descripat":"Carrera orientada a la creación de piezas gráficas efectivas, incluyendo folletos y afiches, con un enfoque en teoría del color, tipografía y composición visual, y el uso de herramientas digitales avanzadas.",
    "grap": "Tecnicatura en Diseño Gráfico",
    "tudai": "Tecnicatura Universitaria en Desarrollo de Aplicaciones Informáticas",
    "university": "Universidad Nacional del Centro de la Provincia de Buenos Aires",
    "myexp": "Mi experiencia en el mundo IT",
    "aboutxp": "Mi trayectoria comenzó en el diseño gráfico, el cual me enseñó la importancia de la atención al detalle, la organización y el enfoque creativo.\n En los últimos años, me he especializado en el mundo del testing automatizado. Domino herramientas como Katalon para pruebas automatizadas, además de Postman para testing de APIs REST y SOAP. He trabajado en la integración continua utilizando Jenkins y Git, y también en testing mobile utilizando Appium.\n\nParalelamente, me fui interiorizando en el mundo del desarrollo web utilizando React, creando aplicaciones propias y combinándolo con proyectos de IoT con Arduino.\nHe estado ampliando mis conocimientos en Python y en desarrollo frontend, impulsada por la motivación de seguir creciendo como profesional en el mundo IT.\n\nEn mi rol actual como QA Automation, tuve la oportunidad de liderar iniciativas desde cero, definiendo estrategias de testing, estableciendo nomenclaturas claras, trabajando bajo el patrón Page Object Model (POM) y desarrollando funciones reutilizables que optimizan y agilizan los procesos de prueba.\n\nMi enfoque combina la precisión y el detalle adquiridos en el diseño gráfico, con la lógica y estructura necesarias para el desarrollo y el testing de software. Me apasiona el desafío de evolucionar constantemente, explorar nuevas herramientas.",
    "miscursos": "Mis Cursos",
    "Idiomas": "Idiomas",
    "espanol": "Español - Nativo",
    "ingles": "Inglés - B2",
    "services": "Mis Servicios",
    "service1.title": "Testing Automatizado",
    "service1.description": "Cuento con experiencia en testing automatizado para UI, back-end y performance, utilizando herramientas como Selenium, Cypress, Katalon, Postman, Newman y JMeter. También he trabajado con Jenkins y Git para la integración continua, manteniéndome en constante aprendizaje sobre nuevas tecnologías y metodologías.\n\nMe especializo en la organización y reutilización de código para optimizar los procesos de prueba, asegurando scripts escalables y mantenibles. Actualmente me capacito en Appium, UFT y RPA para seguir ampliando mis habilidades en automatización.",
    "service2.title": "Testing Manual",
    "service2.description": "Apasionada por la calidad de software, cuento con experiencia en pruebas manuales, exploratorias, unitarias y de regresión. Diseño casos de prueba, reporto bugs y realizo validaciones utilizando consultas SQL y monitoreo de logs, trabajando bajo metodologías ágiles.\n\nParticipo en plataformas de crowdsourced testing freelance para aplicaciones móviles, web y dispositivos Chromecast, realizando pruebas de pago, localización y usabilidad. Utilizo herramientas como TestLink, JIRA, Zephyr y Xray para asegurar una correcta trazabilidad en los casos de prueba.",
    "service3.title": "Desarrollo Full Stack",
    "service3.description": "Actualmente me especializo en el desarrollo Front-End, trabajando con frameworks modernos y aplicando conceptos de diseño UX/UI para construir interfaces intuitivas, responsivas y atractivas. Diseño templates web y desarrollo aplicaciones usando React con TypeScript y React Native.\n\nEn el área Back-End, integro tecnologías como Node.js, FastAPI y MongoDB, implementando autenticación de servicios y documentación de APIs con Swagger. También tengo conocimientos en Angular, JavaScript, Groovy y Python, buscando siempre un código limpio y escalable.",
    "service4.title": "Diseño Gráfico",
    "service4.description": "Como técnica en diseño gráfico, domino herramientas del paquete Adobe para crear piezas de comunicación visual como folletos, publicaciones para redes sociales, identidades visuales y catálogos de marca, aplicando leyes visuales como teoría del color, tipografía y composición.\n\nDiseño interfaces web aplicando principios de usabilidad y estética visual, desde botones y banners hasta la estructuración de sitios completos, garantizando piezas coherentes, funcionales y alineadas con la identidad de cada proyecto.",
    "service5.title": "Community Managment",
    "service5.description": "Me formé de manera autodidacta como Community Manager, gestionando redes sociales como Facebook, Instagram y WhatsApp Business para emprendimientos y marcas, adaptando contenidos al tono de cada cliente y optimizando la comunicación con la comunidad.\n\nDiseño piezas gráficas, planifico calendarios de contenido, realizo sesiones de fotos para foto producto y gestiono campañas pagas en Facebook e Instagram Ads, combinando creatividad y análisis de métricas para lograr comunidades activas y comprometidas.",
    "service6.title": "Project Management",
    "service6.description": "He liderado y gestionado proyectos internos aplicando prácticas de Project Management, utilizando herramientas como Trello y GitLab para la coordinación de tareas, asignación de responsables y seguimiento de avances bajo metodologías ágiles como Scrum.\n\nPlanifico ciclos de prueba, diagramo circuitos de software, defino nomenclaturas estándar y trabajo con OKR para asegurar objetivos estratégicos. También impulso la adopción de nuevas herramientas y metodologías para mejorar la organización y eficiencia de los equipos.",
    "remote": "Estoy disponible para trabajos freelance y remotos, en modalidad full-time o part-time. ¡Lista para colaborar en nuevos proyectos y aportar valor!",
    "charlemos": "Charlemos!",
    "portfolio": "Mi Portfolio",
    "new": "Nuevo",
    "social": "Redes Sociales",
    "card1": "Redes Sociales",
    "card1s": "Diseño de posts para redes sociales.",
    "card2s": "Diseño de posters para fiestas, más...",
    "card3": "Diseño de logos, packaging.",
    "contact1": "¡Hablemos! Envíame tu mensaje",
    "contact2": "Enviar",
    "contact3": "Información de contacto:",
    "contact4": "Telefono:+ 54 2494381315",
    "contact5": "Direccion: Balcarce, Buenos Aires, Argentina.",
    "Lugar": "Lugar",
    "date": "Fecha",
    "Ambito": "Ambito",
    "seecertif": "Ver certificado",
    "mesWork1": "Noviembre 2023 - Presente",
    "placeholderbusqueda":"Filtrar cursos por nombre...", 
    "orderby":"Ordenar por...",
    "fecharecent":"Fecha (más recientes)",
    "placecourse":"Institución (A-Z)",
    "thCurso":"Nombre del curso",
    "thInstitute":"Institución",
    "thFecha":"Fecha",
    "thAmbito":"Disciplina",
    "thCertificado":"Certificado",
    "Siguiente":"Siguiente →", 
    "Anterior":"← Anterior",
    "gitp":"Proyectos en GitHub", 
    "pName": "Nombre *", 
    "pMessage": "Ingrese un mensaje *",
    "confirm": "¡Mensaje enviado con éxito!", 
    "msgerror":"Hubo un error al enviar el mensaje. Intenta nuevamente.",
    "gith":"Ver en GitHub"
}